[
    "The oldest evidence for soup is from 6,000 B.C. and calls for hippopotamus and sparrow meat.",
    "Pound cake got its name from its original recipe, which called for a pound each of butter, eggs, sugar, and flour.",
    "An average ear of corn has an even number of rows, usually 16.",
    "Apples, pears, cherries and strawberries are all members of the rose family.",
    "The most expensive fruit in the world is the Japanese Yubari cantaloupe, and two melons once sold at auction for $23,500.",
    "Canola oil was originally called rapeseed oil, but rechristened by the Canadian oil industry in 1978 to avoid negative connotations. 'Canola' is short for 'Canadian oil.'",
    "There are more than 7,000 varieties of apples grown in the world.",
    "Onion is Latin for 'large pearl'.",
    "A watermelon is over 92% water by weight.",
    "The pumpkin originated in Mexico about 9,000 years ago.",
    "Square watermelons sell for about $85.",
    "Blueberries are a good source of Vitamin C and fiber.",
    "There are more than 600 pasta shapes produced worldwide.",
    "Gorgonzola cheese dates back to the year 879.",
    "Egg yolks are one of the few foods that naturally contain Vitamin D.",
    "French fries came from Belgium, but are most popular in the US.",
    "The oldest know vegetable is the pea.",
    "Ginger can reduce exercise-induced muscle pain by 25%.",
    "Ripe cranberries will bounce like rubber balls.",
    "Eating too much nutmeg has the effect of a hallucinogenic drug.",
    "Chili peppers contain a chemical that tricks your mouth into 'thinking' it's being burned.",
    "Sea salt and table salt contain about the same amount of sodium.",
    "There are around 2000 different plant types that humans use to cultivate food.",
    "The sweet potato is a root vegetable and is not closely related to the potato.",
    "Wine is sold in tinted bottles because it spoils when exposed to light.",
    "Onions, apples and potatoes have the same taste. The differences that we feel are caused by their individual scents.",
    "Honey is the only food that will never spoil.",
    "The average person eats about four pounds of grapes during the year.",
    "If you want to speed pineapple ripening to eat it as soon as possible, then you can do so by turning it upside down, on its leaves.",
    "Fortune cookies were actually invented in San Francisco in the early 1900s.",
    "Chicken Tikka Masala: Indian curry dish was created in Britian to suit the more western palate.",
    "The first written mention of sausages is in 4,000-year-old texts from the acient Sumerians of Mesopotamia.",
    "Although it's called a 'Cuban sandwich' it was invented in Tampa, Florida."
]